[
  {
    "id": "1",
    "title": "Selamat Datang di OurCreativity v4.0 \"Glowar\"!",
    "content": "Salam, para kreator!\n\nDari kami, Tim OurCreativity Edisi Coding. Ada pengumuman gede nih: website kita baru aja dirombak total! Kenalin, ini dia update V4.0 dengan nama sandi **\"Glowar\"**.\n\nKenapa namanya \"Glowar\"? Karena kami mau karyamu itu *glow up* dan jadi pusat perhatian di platform ini. Kami ngerjain ini selama 3 bulan, fokus buat bikin pengalaman kalian di sini jadi jauh lebih keren, lebih cepat, dan lebih seru.\n\n#### **Jadi, Apa Aja yang Berubah? Ini Rangkuman Detailnya:**\n\n**1. Tampilan Baru yang Lebih Segar (UI/UX Rombak Total!)**\nBegitu kamu buka website, kamu pasti langsung sadar bedanya. Seluruh tampilan website sekarang pake bahasa desain baru yang kami namain **\"Glowar\"**. Konsepnya? **\"Luminous Depth\"**—tampilan gelap yang elegan, tapi ada cahaya dan gradien keren yang jadi pemandu.\n*   **Lebih Hidup dengan Animasi:** Animasinya sekarang lebih *cair* dan *bertujuan* berkat GSAP. Nggak ada lagi konten yang 'nyangkut' atau hilang pas kamu scroll. Semua elemen muncul dengan elegan, bikin pengalaman jelajah jadi lebih asyik.\n*   **Navigasi Nempel di Atas:** Header navigasi sekarang 'nempel' di atas layar. Jadi, kamu bisa pindah halaman kapan aja tanpa harus scroll ke atas lagi. Praktis!\n*   **Super Nyaman di HP:** Yang paling penting, sekarang **super nyaman dibuka di HP kamu.** Rasanya kayak pakai aplikasi!\n\n**2. Halaman \"Karya Kami\" Jadi Pameran Digital Keren! ✨**\nIni favorit kami! Halaman \"Karya Kami\" sekarang bukan cuma daftar karya biasa. Udah kami sulap jadi kayak galeri pameran digital pribadi kamu.\n*   **Layout Masonry Cerdas:** Karyamu (foto, video) bakal tersusun otomatis dengan rapi dalam layout *masonry* yang keren banget, nggak peduli ukurannya.\n*   **Mode Fokus (Lightbox):** Klik sebuah karya, dan ia akan muncul di tampilan *pop-up* yang imersif. Kamu bisa lihat detailnya, baca deskripsi, dan bahkan navigasi ke karya selanjutnya (`←` `→`) tanpa harus keluar.\n*   **'Suka' Diganti 'Dilihat':** Tombol 'Like' yang sering error sudah kami **hapus**. Sekarang, popularitas karya diukur dari seberapa sering karya itu dilihat detailnya (`view_count`). Lebih adil, lebih simpel, dan anti-error!\n*   **Filter & Urutkan:** Cari karya jadi lebih gampang. Kamu bisa filter berdasarkan kategori atau urutkan dari yang terbaru sampai yang \"Terpopuler\".\n\n**3. Upload & Manajemen Konten Jadi Lebih Gampang & Aman**\nKami merombak total cara kalian berkontribusi dan cara kami mengelolanya.\n*   **Proses Upload Baru:** Tombol \"Unggah Karya\" sekarang akan membuka *pop-up* (modal) yang modern. Di dalamnya ada:\n    *   **Drag & Drop File:** Kamu bisa seret langsung file dari komputermu.\n    *   **'Karya Tulis' Langsung Ketik:** Nggak perlu lagi upload file `.txt` atau `.docx`. Kamu bisa langsung menulis artikel di dalam form dengan dukungan format **Markdown**.\n    *   **Batas Ukuran File 5MB:** Untuk menjaga performa, semua file media sekarang dibatasi 5MB.\n*   **BUG TULISAN HILANG SUDAH LENYAP!** Kami tahu ada masalah di mana tulisan \"Karya Tulis\" kalian hilang dan cuma deskripsinya yang muncul. Itu sudah kami perbaiki total dengan merombak struktur database Supabase. Sekarang semua karyamu **100% aman tersimpan.**\n*   **Selamat Tinggal Halaman Admin yang Ribet!** Yap, kami **menghilangkan Halaman Admin yang lama dan terpisah itu.** Sekarang, semua pengawasan dan update konten kami lakukan langsung lewat Supabase di belakang layar. Ini membuat website lebih cepat, lebih aman, dan lebih stabil buat kalian.\n\n**4. Cerita & Informasi Disajikan Lebih Hidup**\nHalaman seperti \"Cerita Kami\", \"Informasi\", \"Tim Kami\", dan bahkan \"Syarat & Ketentuan\" bukan lagi cuma teks biasa. Kami desain ulang dengan alur cerita visual, animasi data (seperti counter anggota), komponen interaktif, dan layout yang jauh lebih rapi. Tujuannya? Biar informasi penting jadi lebih menarik dan gampang dipahami.\n\n**5. \"Mesin\" di Dalamnya Juga Baru!**\nDi balik tampilannya, \"mesin\" website ini juga kami *upgrade* total. Struktur kodenya lebih rapi (co-location), databasenya lebih terorganisir, dan semuanya jadi lebih ngebut dan stabil. Ini adalah fondasi kuat untuk fitur-fitur gila di masa depan.\n\n#### **Bocoran untuk Masa Depan: Siap-siap Punya Aplikasi! 📱**\n\nIni baru permulaan, lho. Kami mau kasih bocoran sedikit: Tim Coding lagi siap-siap buat project besar berikutnya... **Aplikasi mobile OurCreativity!**\n\nBetul, aplikasi khusus di HP kamu. Aplikasinya nanti bakal **fokus banget untuk menampilkan Karya kalian** dengan cara yang paling keren dan interaktif. Tunggu tanggal mainnya, ya!\n\n#### **Di Balik Semua Kode Ini...**\n\nSemua keajaiban coding ini nggak bakal ada tanpa tim super kami, baik manusia maupun AI:\n*   **Ardelyo (Frontend Developer & UI/UX Architect):** Dia yang menerjemahkan desain liar \"Glowar\" menjadi kode yang bisa kamu sentuh dan lihat. Setiap tombol, kartu, dan animasi halus adalah hasil karyanya.\n*   **DoctorThink (Backend & Database Engineer):** Otak di balik arsitektur Supabase yang baru, memastikan datamu aman, website berjalan secepat kilat, dan semua logika di belakang layar bekerja tanpa cela.\n*   **Google Jules (Experimental AI QA):** Pemburu bug 24/7 kami. Jules bekerja tanpa lelah di belakang layar untuk menganalisis potensi masalah dan menemukan error sebelum error itu menemukanmu.\n*   **Lovable Bot (AI Code Reviewer):** Asisten cerdas yang mereview setiap *pull request* dan baris kode. Bot ini membantu kami menjaga kualitas, konsistensi, dan efisiensi dalam proses development.\n*   **Seluruh Tim OurCreativity (The Visionaries & Community Champions):** Pasukan pemberi ide, penguji pertama, dan penjaga semangat komunitas yang memastikan semua ini kami bangun *untuk* kalian.\n\nPokoknya, update \"Glowar\" ini kami buat sepenuh hati untuk kalian, dari kami yang di depan layar komputer. Coba deh jelajahi sendiri websitenya dan rasakan bedanya! Misi kami: bikin platform yang asyik, fungsional, dan jadi rumah terbaik buat kreativitas kalian.\n\nSalam ngoding,\n**Tim OurCreativity | Edisi Coding**",
    "category": "update",
    "date": "2025-07-01T00:00:00.000Z",
    "created_at": "2025-07-01T09:00:00.000Z",
    "important": true,
    "published": true,
    "image_url": null,
    "link_url": null
  },
  {
    "id": "8",
    "title": "Mengenang G27A: Hari Pembersihan Komunitas 27 April",
    "content": "Hari ini, kita melihat kembali salah satu momen paling dramatis dalam sejarah komunitas kita: **Gerakan 27 April (G27A)**, yang terjadi pada 27 April 2025.\n\nPada hari itu, sebuah operasi pembersihan anggota pasif (sider) besar-besaran diluncurkan oleh admin di beberapa grup inti kami, terutama di **Edisi Desain Grafis** dan **Edisi Meme Creator**.\n\n**Apa yang Terjadi?**\nDengan tujuan meningkatkan kualitas interaksi dan menjaga keaktifan grup, admin mengambil langkah tegas untuk mengeluarkan anggota yang tidak aktif. Totalnya, **hampir 300+ anggota** dikeluarkan dari grup dalam operasi tersebut.\n\nNamun, operasi ini tidak berjalan tanpa cela. Dalam prosesnya, beberapa anggota yang sebenarnya aktif—bahkan beberapa kreator yang cukup dikenal di komunitas—secara tidak sengaja ikut terkena imbas dan dikeluarkan. Insiden ini menimbulkan kehebohan dan menjadi pelajaran yang sangat berharga bagi kami semua tentang pentingnya kehati-hatian dan komunikasi.\n\nG27A menjadi pengingat bahwa komunitas yang hebat dibangun oleh partisipasi aktif. Momen ini telah membentuk cara kami mengelola komunitas menjadi lebih baik dan lebih bijaksana.\n\nBagi kalian yang menjadi saksi sejarah G27A, mari jadikan ini sebagai pengingat untuk terus berkarya dan bersuara. Karena setiap kontribusi kalian sangat berarti.\n\nSalam,\nTim OurCreativity",
    "category": "community",
    "date": "2025-04-27T00:00:00.000Z",
    "created_at": "2025-04-27T09:00:00.000Z",
    "important": true,
    "published": true,
    "image_url": null,
    "link_url": null
  },
  {
    "id": "5",
    "title": "Update v3.7: Fitur Unggah Karya WUJUDKAN KARYAMU!",
    "content": "Update Terbaru 11 April 2025\n\n**Apa yang Baru?**\nAda pembaruan seru di website kita! Dengan Update v3.7, kini giliran kamu untuk berbagi dan mewujudkan karya kerenmu langsung melalui OurCreativity!\n\n**Fitur \"Unggah Karya\" Spesial Buat Kamu!**\n\n**Yang Kamu Bisa Lakukan:**\n- Pamerkan Kreasimu: Sekarang kamu bisa unggah Gambar, Video, atau Tulisan karyamu sendiri\n- Gampang Banget: Cari tombol \"Unggah Karya\" (ada di header atau halaman Karya Kami)\n- Pilih Jenis Karyamu: Ada pilihan untuk Gambar (JPG, PNG, WebP, GIF - maks 1MB), Video (MP4, WebM, OGG - maks 50MB), atau Tulisan\n\n**Bagaimana Caranya?**\n- Klik tombol \"Unggah Karya\"\n- Isi detail singkat: Judul, Namamu, Kategori (Desain, Video, Tulisan, Meme)\n- Unggah file gambar (maks 1MB) atau video (maks 50MB)\n- Klik Kirim!\n\n**Proses Seleksi & Tampil Karya**\n- Karya yang kamu kirim akan ditinjau oleh tim admin\n- Kami akan melakukan seleksi berdasarkan kriteria seperti orisinalitas, kualitas, dan kesesuaian\n- Karya-karya terpilih akan kami umumkan dan tampilkan di galeri Karya Kami dalam update mingguan\n\n**Ingat Aturan Mainnya Ya:**\n- Pastikan karya itu buatanmu sendiri atau kamu punya izin jelas untuk membagikannya\n- Hargai hak cipta orang lain. Dilarang keras mengunggah karya milik orang lain tanpa izin\n- Jaga konten tetap sopan dan positif (tidak mengandung SARA, kekerasan, dll)\n- Patuhi batas ukuran file (Gambar 1MB, Video 50MB)\n\nKami nggak sabar melihat karya-karya hebat dari kalian! Yuk, segera coba fitur barunya dan WUJUDKAN KARYAMU di galeri OurCreativity! 🔥\n\nSalam Kreatif,\nTim OurCreativity",
    "category": "update",
    "date": "2025-04-11T00:00:00.000Z",
    "created_at": "2025-04-11T09:00:00.000Z",
    "important": true,
    "published": true,
    "image_url": null,
    "link_url": null
  },
  {
    "id": "6",
    "title": "Major Update 3.5: Wajah Baru OurCreativity!",
    "content": "Pembaruan 2 April 2025\n\nSelamat datang di tampilan baru website OurCreativity! Update 3.5 membawa penyegaran visual menyeluruh dengan fokus pada pengalaman pengguna yang modern, intuitif, dan inspiratif.\n\nMengadopsi filosofi desain 'Creative Constellations', kami menghadirkan antarmuka yang terinspirasi iOS: kartu-kartu elegan dengan sudut membulat, efek kedalaman melalui latar belakang blur (backdrop-blur), dan tipografi yang jelas serta mudah dibaca (font-serif untuk judul, font-sans untuk teks).\n\nNavigasi disederhanakan, dan animasi halus (framer-motion) ditambahkan untuk interaksi yang lebih dinamis dan menyenangkan. Palet warna gelap dipertahankan dengan aksen warna cerah (seperti Lavender, Mint, Peach) yang digunakan secara strategis untuk menyorot informasi penting dan kategori.\n\nTujuannya adalah menciptakan ruang digital yang tidak hanya fungsional tetapi juga secara estetis mencerminkan semangat kreativitas, kolaborasi, dan inovasi komunitas kita.",
    "category": "update",
    "date": "2025-04-02T00:00:00.000Z",
    "created_at": "2025-04-02T09:00:00.000Z",
    "important": true,
    "published": true,
    "image_url": null,
    "link_url": null
  }
]
